In [73]:
import numpy as np
import pandas as pd

In [74]:
titanic_train = pd.read_csv("/Users/victormorenorequena/Desktop/Python_Youtube/titanic/train.csv")
char_cabin = titanic_train["Cabin"].astype(str)
new_Cabin = np.array([cabin[0]for cabin in char_cabin])
titanic_train["Cabin"] = pd.Categorical(new_Cabin)

In [75]:
my_tab = pd.crosstab(index=titanic_train["Survived"],
                     columns= "count")

my_tab

col_0     count
Survived
0           549
1           342

In [76]:
type(my_tab)

pandas.core.frame.DataFrame

In [77]:
pd.crosstab(index=titanic_train["Pclass"],
                     columns= "count")

col_0   count
Pclass
1         216
2         184
3         491

In [78]:
pd.crosstab(index=titanic_train["Sex"],
                     columns= "count")

col_0   count
Sex
female    314
male      577

In [79]:
cabin_tab = pd.crosstab(index=titanic_train["Cabin"],
                     columns= "count")


type(cabin_tab)
cabin_tab

col_0  count
Cabin
A         15
B         47
C         59
D         33
E         32
F         13
G          4
T          1
n        687

In [80]:
titanic_train.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [81]:
print(cabin_tab.sum(), "\n")
print(cabin_tab.shape, "\n")
cabin_tab.iloc[1:7]

col_0
count    891
dtype: int64

(9, 1)

col_0  count
Cabin
B         47
C         59
D         33
E         32
F         13
G          4

In [82]:
cabin_tab/cabin_tab.sum()

col_0     count
Cabin
A      0.016835
B      0.052750
C      0.066218
D      0.037037
E      0.035915
F      0.014590
G      0.004489
T      0.001122
n      0.771044

In [83]:
#table of survival vs sex
survived_sex = pd.crosstab(index=titanic_train["Survived"],
                           columns=titanic_train["Sex"])
survived_sex.index=["Died", "Survived"]
survived_sex

Sex       female  male
Died          81   468
Survived     233   109

In [84]:
survived_class = pd.crosstab(index=titanic_train["Survived"],
                           columns=titanic_train["Pclass"],)

survived_class.columns = ["Class 1", "Class 2", "Class 3"]
survived_class.index=["Died", "Survived"]
survived_class

          Class 1  Class 2  Class 3
Died           80       97      372
Survived      136       87      119

In [86]:
survived_class = pd.crosstab(index=titanic_train["Survived"],
                           columns=titanic_train["Pclass"],
                           margins=True)

survived_class.columns = ["Class 1", "Class 2", "Class 3", "rowtotal"]
survived_class.index=["Died", "Survived", "coltotal"]
survived_class

          Class 1  Class 2  Class 3  rowtotal
Died           80       97      372       549
Survived      136       87      119       342
coltotal      216      184      491       891

In [88]:
survived_class/survived_class.loc["coltotal", "rowtotal"]

           Class 1   Class 2   Class 3  rowtotal
Died      0.089787  0.108866  0.417508  0.616162
Survived  0.152637  0.097643  0.133558  0.383838
coltotal  0.242424  0.206510  0.551066  1.000000

In [89]:
survived_class/survived_class.loc["coltotal"]

          Class 1   Class 2   Class 3  rowtotal
Died      0.37037  0.527174  0.757637  0.616162
Survived  0.62963  0.472826  0.242363  0.383838
coltotal  1.00000  1.000000  1.000000  1.000000

In [90]:
survived_class.div(survived_class["rowtotal"],
                   axis=0)

           Class 1   Class 2   Class 3  rowtotal
Died      0.145719  0.176685  0.677596       1.0
Survived  0.397661  0.254386  0.347953       1.0
coltotal  0.242424  0.206510  0.551066       1.0

In [91]:
survived_class.T/survived_class["rowtotal"]

              Died  Survived  coltotal
Class 1   0.145719  0.397661  0.242424
Class 2   0.176685  0.254386  0.206510
Class 3   0.677596  0.347953  0.551066
rowtotal  1.000000  1.000000  1.000000

In [96]:
surv_sex_class = pd.crosstab(index=titanic_train["Survived"],
                             columns=[titanic_train["Pclass"],
                                     titanic_train["Sex"]],
                            margins=True) 
                                     
surv_sex_class

Pclass        1           2           3       All
Sex      female male female male female male
Survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891

In [97]:
surv_sex_class[2]

Sex       female  male
Survived
0              6    91
1             70    17
All           76   108

In [98]:
surv_sex_class[2]["female"]

Survived
0       6
1      70
All    76
Name: female, dtype: int64

In [99]:
surv_sex_class/surv_sex_class.loc["All"]

Pclass           1                   2                3                 All
Sex         female      male    female      male female      male
Survived
0         0.031915  0.631148  0.078947  0.842593    0.5  0.864553  0.616162
1         0.968085  0.368852  0.921053  0.157407    0.5  0.135447  0.383838
All       1.000000  1.000000  1.000000  1.000000    1.0  1.000000  1.000000